---
kind: other
id: AllMembers.T:Autodesk.Revit.Exceptions.DirectoryNotFoundException
source: html/1d431209-af7a-ff18-e314-8f3153afb300.htm
---
# DirectoryNotFoundException Members

Retrieves data needed to serialize the target object.